---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.GeometryChecksum
source: html/1f839e5c-1c4a-f4de-94d5-4662f38c18f3.htm
---
# Autodesk.Revit.DB.FabricationPart.GeometryChecksum Property

Gets the geometry checksum of the fabrication part symbol, and it does nothing with the fabrication part instance position.

## Syntax (C#)
```csharp
public AssetPropertyUInt64 GeometryChecksum { get; }
```